Revit 2024 API
PointIterator.Dispose Method
Releases all resources used by the PointIterator
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
See Also
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace